IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_DMAXBAR_CONTROLSS_DMAXBAR.xml
	<register id="CONTROLSS_DMAXBAR_DMAXBAR1_G4" acronym="CONTROLSS_DMAXBAR_DMAXBAR1_G4" offset="0x154" width="8" description="">
		<bitfield id="SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding xbar0: SD0.FILT1.DRINT1: SD0.FILT2.DRINT2: SD0.FILT3.DRINT3: SD0.FILT4.DRINT4: SD1.FILT1.DRINT5: SD1.FILT2.DRINT6: SD1.FILT3.DRINT7: SD1.FILT4.DRINT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR1_G5" acronym="CONTROLSS_DMAXBAR_DMAXBAR1_G5" offset="0x158" width="8" description="">
		<bitfield id="SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding xbar0: ECAP0.DMA_INT1: ECAP1.DMA_INT2: ECAP2.DMA_INT3: ECAP3.DMA_INT4: ECAP4.DMA_INT5: ECAP5.DMA_INT6: ECAP6.DMA_INT7: ECAP7.DMA_INT8: ECAP8.DMA_INT9: ECAP9.DMA_INT" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR2_GSEL" acronym="CONTROLSS_DMAXBAR_DMAXBAR2_GSEL" offset="0x180" width="8" description="">
		<bitfield id="GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0: G0 selected..5: G5 selected" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR2_G0" acronym="CONTROLSS_DMAXBAR_DMAXBAR2_G0" offset="0x184" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ETPWM SOCA to corresponding xbar1: PWMx.SOCA is selected0: PWMx.SOCA is de-selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR2_G1" acronym="CONTROLSS_DMAXBAR_DMAXBAR2_G1" offset="0x188" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ETPWM SOCB to corresponding xbar1: PWMx.SOCB is selected0: PWMx.SOCB is de-selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR2_G2" acronym="CONTROLSS_DMAXBAR_DMAXBAR2_G2" offset="0x18C" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding xbar0: ADC0.INT11: ADC0.INT22: ADC0.INT33: ADC0.INT44: ADC0.EVTINT5: ADC1.INT16: ADC1.INT27: ADC1.INT38: ADC1.INT49: ADC1.EVTINT10: ADC2.INT111: ADC2.INT212: ADC2.INT313: ADC2.INT414: ADC2.EVTINT15: ADC3.INT116: ADC3.INT217: ADC3.INT318: ADC3.INT419: ADC3.EVTINT20: ADC4.INT121: ADC4.INT222: ADC4.INT323: ADC4.INT424: ADC4.EVTINT" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR2_G3" acronym="CONTROLSS_DMAXBAR_DMAXBAR2_G3" offset="0x190" width="8" description="">
		<bitfield id="SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding xbar0: FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12: FSIRX0_DMATRIG23: FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15: FSIRX1_DMATRIG26: FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18: FSIRX2_DMATRIG29: FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111: FSIRX3_DMATRIG212: FSITX0.TX_DMA_EVT13: FSITX1.TX_DMA_EVT14: FSITX2.TX_DMA_EVT15: FSITX3.TX_DMA_EVT" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR2_G4" acronym="CONTROLSS_DMAXBAR_DMAXBAR2_G4" offset="0x194" width="8" description="">
		<bitfield id="SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding xbar0: SD0.FILT1.DRINT1: SD0.FILT2.DRINT2: SD0.FILT3.DRINT3: SD0.FILT4.DRINT4: SD1.FILT1.DRINT5: SD1.FILT2.DRINT6: SD1.FILT3.DRINT7: SD1.FILT4.DRINT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR2_G5" acronym="CONTROLSS_DMAXBAR_DMAXBAR2_G5" offset="0x198" width="8" description="">
		<bitfield id="SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding xbar0: ECAP0.DMA_INT1: ECAP1.DMA_INT2: ECAP2.DMA_INT3: ECAP3.DMA_INT4: ECAP4.DMA_INT5: ECAP5.DMA_INT6: ECAP6.DMA_INT7: ECAP7.DMA_INT8: ECAP8.DMA_INT9: ECAP9.DMA_INT" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR3_GSEL" acronym="CONTROLSS_DMAXBAR_DMAXBAR3_GSEL" offset="0x1C0" width="8" description="">
		<bitfield id="GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0: G0 selected..5: G5 selected" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR3_G0" acronym="CONTROLSS_DMAXBAR_DMAXBAR3_G0" offset="0x1C4" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ETPWM SOCA to corresponding xbar1: PWMx.SOCA is selected0: PWMx.SOCA is de-selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR3_G1" acronym="CONTROLSS_DMAXBAR_DMAXBAR3_G1" offset="0x1C8" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ETPWM SOCB to corresponding xbar1: PWMx.SOCB is selected0: PWMx.SOCB is de-selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR3_G2" acronym="CONTROLSS_DMAXBAR_DMAXBAR3_G2" offset="0x1CC" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding xbar0: ADC0.INT11: ADC0.INT22: ADC0.INT33: ADC0.INT44: ADC0.EVTINT5: ADC1.INT16: ADC1.INT27: ADC1.INT38: ADC1.INT49: ADC1.EVTINT10: ADC2.INT111: ADC2.INT212: ADC2.INT313: ADC2.INT414: ADC2.EVTINT15: ADC3.INT116: ADC3.INT217: ADC3.INT318: ADC3.INT419: ADC3.EVTINT20: ADC4.INT121: ADC4.INT222: ADC4.INT323: ADC4.INT424: ADC4.EVTINT" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR3_G3" acronym="CONTROLSS_DMAXBAR_DMAXBAR3_G3" offset="0x1D0" width="8" description="">
		<bitfield id="SEL" width="4" begin="3" end="0" resetval="0x0" description="FSI DMA requests to corresponding xbar0: FSIRX0.RX_DMA_EVT1; FSIRX0_DMATRIG12: FSIRX0_DMATRIG23: FSIRX1.RX_DMA_EVT4; FSIRX1_DMATRIG15: FSIRX1_DMATRIG26: FSIRX2.RX_DMA_EVT7; FSIRX2_DMATRIG18: FSIRX2_DMATRIG29: FSIRX3.RX_DMA_EVT10; FSIRX3_DMATRIG111: FSIRX3_DMATRIG212: FSITX0.TX_DMA_EVT13: FSITX1.TX_DMA_EVT14: FSITX2.TX_DMA_EVT15: FSITX3.TX_DMA_EVT" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR3_G4" acronym="CONTROLSS_DMAXBAR_DMAXBAR3_G4" offset="0x1D4" width="8" description="">
		<bitfield id="SEL" width="3" begin="2" end="0" resetval="0x0" description="SDFM DMA requests to corresponding xbar0: SD0.FILT1.DRINT1: SD0.FILT2.DRINT2: SD0.FILT3.DRINT3: SD0.FILT4.DRINT4: SD1.FILT1.DRINT5: SD1.FILT2.DRINT6: SD1.FILT3.DRINT7: SD1.FILT4.DRINT" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR3_G5" acronym="CONTROLSS_DMAXBAR_DMAXBAR3_G5" offset="0x1D8" width="8" description="">
		<bitfield id="SEL" width="4" begin="3" end="0" resetval="0x0" description="ECAP DMA requests to corresponding xbar0: ECAP0.DMA_INT1: ECAP1.DMA_INT2: ECAP2.DMA_INT3: ECAP3.DMA_INT4: ECAP4.DMA_INT5: ECAP5.DMA_INT6: ECAP6.DMA_INT7: ECAP7.DMA_INT8: ECAP8.DMA_INT9: ECAP9.DMA_INT" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR4_GSEL" acronym="CONTROLSS_DMAXBAR_DMAXBAR4_GSEL" offset="0x200" width="8" description="">
		<bitfield id="GSEL" width="3" begin="2" end="0" resetval="0x0" description="Select input source:0: G0 selected..5: G5 selected" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR4_G0" acronym="CONTROLSS_DMAXBAR_DMAXBAR4_G0" offset="0x204" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ETPWM SOCA to corresponding xbar1: PWMx.SOCA is selected0: PWMx.SOCA is de-selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR4_G1" acronym="CONTROLSS_DMAXBAR_DMAXBAR4_G1" offset="0x208" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ETPWM SOCB to corresponding xbar1: PWMx.SOCB is selected0: PWMx.SOCB is de-selected" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_DMAXBAR_DMAXBAR4_G2" acronym="CONTROLSS_DMAXBAR_DMAXBAR4_G2" offset="0x20C" width="8" description="">
		<bitfield id="SEL" width="5" begin="4" end="0" resetval="0x0" description="ADC DMA requests to corresponding xbar0: ADC0.INT11: ADC0.INT22: ADC0.INT33: ADC0.INT44: ADC0.EVTINT5: ADC1.INT16: ADC1.INT27: ADC1.INT38: ADC1.INT49: ADC1.EVTINT10: ADC2.INT111: ADC2.INT212: ADC2.INT313: ADC2.INT414: ADC2.EVTINT15: ADC3.INT116: ADC3.INT217: ADC3.INT318: ADC3.INT419: ADC3.EVTINT20: ADC4.INT121: ADC4.INT222: ADC4.INT323: ADC4.INT424: ADC4.EVTINT" range="4 - 0" rwaccess="RW"/>
	</register>
